Revit 2027 API
Element.DesignOption Property
Returns the design option to which the element belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DesignOption DesignOption { get; }
Public ReadOnly Property DesignOption As DesignOption
	Get
public:
property DesignOption^ DesignOption {
	DesignOption^ get ();
}
member DesignOption : DesignOption with get
Property Value
DesignOption
Remarks
If the element is not in a design option, i.e. in the main model, then this property will return null.
Example
void Getinfo_DesignOption(Document document)
{
    // Get the selected Elements in the Active Document
    UIDocument uidoc = new UIDocument(document);
    ICollection<ElementId> selectedIds = uidoc.Selection.GetElementIds();
    foreach (ElementId id in selectedIds)
    {
        Element element = document.GetElement(id);
        //Use the DesignOption property of Element
        if (element.DesignOption != null)
        {
            TaskDialog.Show("Revit",element.DesignOption.Name.ToString());
        }
    }
}
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace